{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "Model", "config": {"name": "vgg19", "input_layers": [["input_1", 0, 0]], "output_layers": [["block5_pool", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false}}, {"name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "block1_pool", "trainable": false, "padding": "valid"}}, {"name": "block2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "block2_pool", "trainable": false, "padding": "valid"}}, {"name": "block3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block3_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block3_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block3_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block3_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block3_conv4", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block3_conv4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "block3_pool", "trainable": false, "padding": "valid"}}, {"name": "block4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block4_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block4_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block4_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block4_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block4_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block4_conv4", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block4_conv4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "block4_pool", "trainable": false, "padding": "valid"}}, {"name": "block5_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block5_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": false, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block5_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block5_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block5_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block5_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block5_conv4", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "block5_conv4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "kernel_regularizer": null}}, {"name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "block5_pool", "trainable": true, "padding": "valid"}}]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "name": "dense_1", "units": 256, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.4, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "softmax", "bias_regularizer": null, "name": "dense_2", "units": 23, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}]}